package com.tort.mudai.event

import org.scalatest.FunSuite

class MoveTriggerTest extends FunSuite {
  val input = "Вы поплелись на запад.\n" +
    "\u001B[1;36mУ печи\u001B[0;37m\n" +
    "   Большая русская печь, сложенная из каленого кирпича, стоит в избе и светит\n" +
    "обмазанными мелом боками. Русская земля богата, но и крепка студеными морозами, \n" +
    "и только на печи можно отогреться.\n" +
    "\n" +
    "\u001B[0;36m[ Exits: n (e) w ]\u001B[0;37m\n" +
    "\u001B[1;33m\u001B[1;31m(летит) Комар жужжит здесь.\n" +
    "Таракан быстро пробежал здесь.\n" +
    "\u001B[0;37m\u001B[0;31mКомар попытался ужалить Вас, но промахнулся.\n" +
    "\u001B[0;37m\n" +
    "\u001B[0;32m40H\u001B[0;37m \u001B[0;32m90M\u001B[0;37m 193о Зауч:0 \u001B[0;32m[Веретень:Невредим]\u001B[0;37m \u001B[0;32m[комар:Невредим]\u001B[0;37m > ЪЫ"

  test("move with agro"){
    val trigger = new MoveTrigger(null)
    assert(trigger.matches(input))
  }
}